## Datasets Preprocessing

## Dataset "precios_semana_20200413"

In [1]:
import pandas as pd
import numpy as np

In [35]:
precios_semana_20200413 = pd.read_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\precios_semana_20200413.csv', encoding='utf-16 LE')

In [9]:
precios_semana_20200413.head(5)

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

## Dataset "precios_semana_20200503"

In [36]:
precios_semana_20200503 = pd.read_json(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\precios_semana_20200503.json', encoding='utf-8')

In [12]:
precios_semana_20200503.head(5)

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-187
1    39.9  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59

## Dataset "precios_semana_20200518"

In [37]:
precios_semana_20200518 = pd.read_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\precios_semana_20200518.txt',sep='|', encoding='utf-8')

In [15]:
precios_semana_20200518.head(5)

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

## Dataset "precios_semanas_20200419_20200426"

In [ ]:
precios_semana_20200419 = pd.read_excel(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\precios_semanas_20200419_20200426.xlsx', sheet_name='precios_20200419_20200419')

# Week 20200419 (second excel sheet)

In [23]:
precios_semana_20200419.head(5)

   precio          sucursal_id producto_id
0   29.90              2-1-184        2288
1   39.90              2-1-206        2288
2  499.99              9-1-430      205870
3  539.99              9-2-107      205870
4  539.99  5218-03-09 00:00:00      205870

In [39]:
precios_semana_20200426 = pd.read_excel(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\precios_semanas_20200419_20200426.xlsx', sheet_name='precios_20200426_20200426')

# Week 20200426 (first excel sheet)

In [25]:
precios_semana_20200426.head(5)

    precio sucursal_id  producto_id
0    399.0     2-1-092       2288.0
1    299.0     2-1-206       2288.0
2    399.0     2-2-241       2288.0
3  49999.0     9-1-430     205870.0
4  53999.0       9-2-4     205870.0

## Dataset "Producto"

In [31]:
Producto = pd.read_parquet(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\Producto.parquet', engine= 'pyarrow')

In [32]:
Producto.head(5)

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

## Dataset "sucursal"

In [98]:
Sucursal = pd.read_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets\Datasets relevamiento precios\sucursal.csv', encoding='utf-8')

In [112]:
Sucursal.head(5)

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

## Datasets Normalization

I check each week entries

In [37]:
precios_semana_20200518.head(1)

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-009

In [38]:
precios_semana_20200503.head(1)

  precio    producto_id sucursal_id
0   29.9  0000000002288     2-1-187

In [39]:
precios_semana_20200426.head(1) # product's ID are missing zeros and are not intergers

   precio sucursal_id  producto_id
0   399.0     2-1-092       2288.0

In [40]:
precios_semana_20200419.head(1)

   precio sucursal_id producto_id
0    29.9     2-1-184        2288

In [41]:
precios_semana_20200413.head(1)

   precio    producto_id sucursal_id
0    29.9  0000000001663     2-1-014

I check the "Producto" dataset

In [42]:
Producto.head() # ID not consistent with the amount of zeros, 
                # "nombre" column is not representative,
                # missing values in the categories columns

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

I work on the ID column

In [ ]:
pd.unique(Producto.id.values) # I see what kind of numbers the column has

In [51]:
Producto.id.nunique() # I count the products total amount

72038

In [61]:
Producto.id.astype(float) # I doesn't let me turn them into float because some ID's have especial
                          # characters

ValueError: could not convert string to float: '1-1-1500210000009'

In [66]:
Producto[Producto.id == '1-1-1500210000009'] # I check if the ID's with especial characters
                                             # are associated to a product

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
1922,1-1-1500210000009,LA SERENÍSIMA,Queso Cremon Light La Serenisima 1 Kg,1.0 kg,None,None,None

In [73]:
Producto['id'] = Producto.id.str.replace('-','') # I replace the middle dash with nothing

In [75]:
Producto[Producto.id == '111500210000009']

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
1922,111500210000009,LA SERENÍSIMA,Queso Cremon Light La Serenisima 1 Kg,1.0 kg,None,None,None

In [77]:
producto_id_duplicado = Producto[Producto.id.duplicated()] # I create a Dataframe to see if 
                                                           # there are duplicated ID's

In [78]:
producto_id_duplicado # No duplicated ID's

Empty DataFrame
Columns: [id, marca, nombre, presentacion, categoria1, categoria2, categoria3]
Index: []

In [81]:
Producto.id = Producto.id.astype(np.int64) # I convert the ID's to integer

In [82]:
Producto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72038 entries, 0 to 72037
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            72038 non-null  int64
 1   marca         72036 non-null  object
 2   nombre        72036 non-null  object
 3   presentacion  72036 non-null  object
 4   categoria1    4 non-null      object
 5   categoria2    4 non-null      object
 6   categoria3    4 non-null      object
dtypes: int64(1), object(6)
memory usage: 3.8+ MB

In [83]:
producto_id_duplicado = Producto[Producto.id.duplicated()] # I check once more if there are 
                                                           # duplicated ID's

In [84]:
producto_id_duplicado # No duplicated ID's

Empty DataFrame
Columns: [id, marca, nombre, presentacion, categoria1, categoria2, categoria3]
Index: []

In [85]:
Producto.head()

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,1663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

In [86]:
Producto[Producto.id == 2288] # I check that the ID matches con a random ID from one 
                              # of the weekly sales dataset

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None

In [87]:
Producto[Producto.id == 7790520005625] # I check that the ID matches con a random ID from one 
                                       # of the weekly sales dataset

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
24842,7790520005625,GLADE,Desodorante de Ambiente Toque Calidez de Hogar...,9.0 gr,None,None,None

I check the categories columns

In [53]:
Producto[Producto['categoria1'] == 'Almacén'] # I see how the categories work

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
53619,7798024299045,None,None,None,Almacén,Aceites,Aerosol
55798,7798061190213,None,None,None,Almacén,Aceites,Oliva

In [43]:
pd.unique(Producto.categoria1.values) # I see what categories there are
# I could change the "None" values for "No category"

array([None, 'Perfumería y Cuidado Personal', 'Almacén',
       'Alimentos Congelados'], dtype=object)

In [92]:
Producto.categoria1.fillna('Sin categoria',inplace=True) # I replace the "None" values for "No category"
pd.unique(Producto.categoria1.values)

In [44]:
pd.unique(Producto.categoria2.values) # I see what categories there are
# I could change the "None" values for "No category"

array([None, 'Cuidado Capilar', 'Aceites', 'Helados'], dtype=object)

In [95]:
Producto.categoria2.fillna('Sin categoria',inplace=True) # I replace the "None" values for "No category"
pd.unique(Producto.categoria2.values)

array(['Sin categoria', 'Cuidado Capilar', 'Aceites', 'Helados'],
      dtype=object)

In [45]:
pd.unique(Producto.categoria3.values) # I see what categories there are
# I could change the "None" values for "No category"

array([None, 'Acondicionadores', 'Aerosol', 'Oliva', 'Helados'],
      dtype=object)

In [96]:
Producto.categoria3.fillna('Sin categoria',inplace=True) # I replace the "None" values for "No category"
pd.unique(Producto.categoria3.values)

array(['Sin categoria', 'Acondicionadores', 'Aerosol', 'Oliva', 'Helados'],
      dtype=object)

I check the "id" and "nombre" columns names

In [97]:
Producto.head() # the "nombre" column I could rename it as "producto", so could with the "id" column
                # as "producto_id"
                # and clear the redundant information from the "nombre column"

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,1663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,Sin categoria,Sin categoria,Sin categoria
1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,Sin categoria,Sin categoria,Sin categoria
2,205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria
3,205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria
4,205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria

In [101]:
Producto.rename(columns={'id':'producto_id'}, inplace=True) # I rename the "id" column
Producto.rename(columns={'nombre':'producto'}, inplace=True) # I rename the "nombre" column

In [102]:
Producto.head()

,producto_id,marca,producto,presentacion,categoria1,categoria2,categoria3
0,1663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,Sin categoria,Sin categoria,Sin categoria
1,2288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,Sin categoria,Sin categoria,Sin categoria
2,205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria
3,205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria
4,205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,Sin categoria,Sin categoria,Sin categoria

In [103]:
Producto.producto = Producto.producto.str.replace('1 Un','') # I replace "1 Un" for nothing
Producto.producto = Producto.producto.str.replace('1 Kg','') # I replace "1 Kg" for nothing

In [104]:
Producto.head()

,producto_id,marca,producto,presentacion,categoria1,categoria2,categoria3
0,1663,LA ANÓNIMA,Radicheta Atada La Anonima,1.0 un,Sin categoria,Sin categoria,Sin categoria
1,2288,LA ANÓNIMA,Perejil Atado La Anonima,1.0 un,Sin categoria,Sin categoria,Sin categoria
2,205870,SIN MARCA,Ojo de Bife,1.0 kg,Sin categoria,Sin categoria,Sin categoria
3,205894,SIN MARCA,Milanesa de Peceto Novillito,1.0 kg,Sin categoria,Sin categoria,Sin categoria
4,205955,SIN MARCA,Chiquizuela Novillito,1.0 kg,Sin categoria,Sin categoria,Sin categoria

In [105]:
Producto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72038 entries, 0 to 72037
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   producto_id   72038 non-null  int64
 1   marca         72036 non-null  object
 2   producto      72036 non-null  object
 3   presentacion  72036 non-null  object
 4   categoria1    72038 non-null  object
 5   categoria2    72038 non-null  object
 6   categoria3    72038 non-null  object
dtypes: int64(1), object(6)
memory usage: 3.8+ MB

## I check the "Sucursal" dataset

In [99]:
Sucursal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2333 entries, 0 to 2332
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   2333 non-null   object
 1   comercioId           2333 non-null   int64
 2   banderaId            2333 non-null   int64
 3   banderaDescripcion   2333 non-null   object
 4   comercioRazonSocial  2333 non-null   object
 5   provincia            2333 non-null   object
 6   localidad            2333 non-null   object
 7   direccion            2333 non-null   object
 8   lat                  2333 non-null   float64
 9   lng                  2333 non-null   float64
 10  sucursalNombre       2333 non-null   object
 11  sucursalTipo         2333 non-null   object
dtypes: float64(2), int64(2), object(8)
memory usage: 218.8+ KB

In [100]:
Sucursal.head()

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [101]:
pd.unique(Sucursal.localidad) # There are many localities in upper case

array(['SALSIPUEDES', 'San Isidro', 'Hurlingham', 'Malvinas Argentinas',
       'Salta', 'San Justo', 'San Juan', 'Comodoro Rivadavia',
       'General Roca', 'Olavarría', 'Río Grande', 'Santa Rosa',
       'Bariloche', 'San Martín', 'San Nicolás', 'Neuquén', 'Corrientes',
       'Monte Grande', 'Ushuaia', 'Trelew', 'Guaymallen',
       'San Fernando del Valle de Catamarca', 'Puerto Madryn', 'Rosario',
       'Maschwitz', 'Vicente López', 'Olivos', 'Moreno', 'Zárate',
       'Ciudad Autónoma de Buenos Aires', 'San Miguel', 'Mar del Plata',
       'Bernal', 'Pergamino', 'Adrogué', 'Lomas de Zamora', 'Campana',
       'Concordia', 'Don Torcuato', 'Villa Mercedes', 'General Pacheco',
       'Jardin Espinoza', 'Gualeguaychu', 'Luján', 'San Fernando',
       'Venado Tuerto', 'Pilar', 'Mendoza', 'Ituzaingó',
       'General Rodríguez', 'Tandil', 'Temperley', 'Merlo', 'Haedo',
       'Resistencia', 'San Miguel de Tucumán', 'Martín Coronado',
       'Río Gallegos', 'Florencio Varela', 'Quintas de Arguello', 'Tigre',
       'Villa Allende Lomas', 'Formosa', 'Glew', 'Balcarce', 'Santa Cruz',
       'Quilmes', 'La Plata', 'Villa Urquiza', 'Avellaneda',
       'Bahía Blanca', 'Río Cuarto', 'Jujuy', 'Paraná', 'La Rioja',
       'San Luis', 'Lanús', 'Escobar', 'Carapachay', 'Chilavert',
       'Ciudad Jardín del Palomar', 'Martínez', 'Villa Ballester',
       'Acassuso', 'José León Suárez', 'Tupungato', 'Luján de Cuyo',
       'Godoy Cruz', 'Alto Verde', 'Yerba Buena', 'Jose León Suárez',
       'Adolfo Sordeaux', 'Victoria', 'Del Viso', 'Maquinista Savio',
       'Villa Adelina', 'Beccar', 'Los Polvorines', 'Castelar', 'Munro',
       'Morón', 'Don Bosco', 'Monte Chingolo', 'Burzaco', 'Longchamps',
       'Almirante Brown', 'Ezpeleta', 'Banfield', 'Gerli',
       'Remedios de Escalada', 'Budge', 'Valentín Alsina', 'Wilde',
       'Isidro Casanova', 'Villa Bosh', 'Gregorio de Laferrere',
       'Ramos Mejía', 'Villa Celina', 'La Matanza', 'Palomar', 'Tapiales',
       'San Antonio de Padua', 'Paso del Rey', 'Grand Bourg',
       'Berazategui', 'Ezeiza', '3 de Febrero', 'Córdoba', 'Derqui',
       'LA RIOJA', 'SALTA', 'SANTIAGO DEL ESTERO', 'TIGRE', 'MAIPU',
       'NEUQUEN', 'SAN CARLOS DE BARILOCHE', 'SANTA ROSA', 'FORMOSA',
       'SAN FERNANDO DEL VALLE DE CATAMARCA', 'ALMIRANTE BROWN', 'MORENO',
       'SAN SALVADOR DE JUJUY', 'INGENIERO PABLO NOGUES',
       'BANDA DEL RIO SALI', 'CASEROS', 'CIPOLLETTI', 'PARANA', 'TRELEW',
       'LANUS', 'POSADAS', 'SAN RAMON DE LA NUEVA ORAN', 'VIEDMA',
       'VILLA MERCEDES', 'VILLA NUEVA', 'GONZALEZ CATAN',
       'BARRIO MATIENZO *', 'JUNIN', 'GENERAL SAN MARTIN', 'GOYA',
       'BARRIO CASTAÑARES', 'TEMPERLEY', 'GENERAL PICO', 'TARTAGAL',
       'BARRIO RAWSON', 'SAN MIGUEL DE TUCUMAN', 'CORRIENTES',
       'CONCEPCION', 'SAN JUAN', 'BARRIO AERONAUTICO *',
       'PRESIDENCIA ROQUE SAENZ PEÑA', 'PUERTO MADRYN', 'CLAYPOLE',
       'SAN PEDRO', 'CLORINDA', 'GENERAL ROCA', 'MORON',
       'CIUDAD AUTONOMA BUENOS AIRES', 'JOSE CLEMENTE PAZ', 'SAN MARTIN',
       'WILLIAMS MORRIS *', 'VILLA SANTOS TESEI', 'PERGAMINO',
       'SAN VICENTE', 'RIO CUARTO', 'SAN LUIS', 'SAN FERNANDO',
       'MENDOZA CIUDAD', 'BARRIO RIVADAVIA', 'CIUDAD DE CORDOBA NORTE',
       'LUJAN', 'SARANDI', 'TABLADA', 'BARRIO EL DORADO',
       'GREGORIO DE LAFERRERE', 'OLAVARRIA', 'COMODORO RIVADAVIA',
       'RESISTENCIA', 'GODOY CRUZ', 'PILAR', 'SANTOS LUGARES',
       'SAN JUSTO', 'AVELLANEDA', 'LA PLATA NOROESTE DE LA CALLE 50',
       'BAHIA BLANCA', 'SANTA FE', 'VILLANUEVA', 'Capital Federal',
       'Lomas De Zamora', 'Parana', 'V Illa Lugano', 'San Martin',
       'Caballito', 'Ciudad De Santa Fe', 'Lugano', 'Bella Vista',
       'Cdad. De Bs.As', 'Ciudadela', 'Gonzalez Catan', 'Jose C Paz',
       'Parque Chacabuco', 'Gral Madariaga', 'Cuidad De Santa Fe', 'Once',
       'Saavedra', 'Neuquen', 'Lanus', 'Vicente Lopez', 'Constitucion',
       'La Horqueta', 'Garin', 'Paternal', 'Belgrano', 'Barrio Norte',
       'General Lavalle', 'San Antonio De Padua', 'Moron', 'Caba',
       'Palermo', 'San Telmo', 'Villa Devoto', 'Florida', 'Liniers',
       'Flores Sur', 'Almagro', 'Boedo', 'Flores', 'Mar De Ajo',
       'Ramos Mejia', 'Devoto', 'Santos Lugares', 'Floresta',
       'Tribunales', 'Pompeya', 'Sarandi', 'Las Lomas', 'Punta Chica',
       'Parque Patricios', 'San Cristobal', 'Villa Crespo', 'Villa Luro',
       'Mataderos', 'Abasto', 'Vte Lopez', 'Fisherton', 'Plottier',
       'Choele Choel', 'Lamarque', 'Luis Beltran', 'Trenque Lauquen',
       'Catriel', 'Pehuajó', 'Allen', 'Zapala', '9 de Julio', 'Lobería',
       'Cutral Co', 'Batán', 'Cinco Saltos', 'Andacollo', 'Loncopué',
       'San Martín de los Andes', 'Viedma', 'Cipolletti', 'Bahia Blanca',
       'Las Lajas', 'Villa Gesell', 'Chos Malal', 'Junín de los Andes',
       'NECOCHEA', 'Pedro Luro', 'Guatrache', 'Punta Alta', 'Azul',
       'Pigue', 'Coronel Dorrego', 'Coronel Suarez', 'Tres Arroyos',
       'Coronel Pringles', 'General Cerri', 'Puan', 'Necochea',
       'Benito Juarez', 'Tornquist', 'Río Colorado', 'General Acha',
       'General Lamadrid', 'Villa Regina', 'Puerto Belgrano',
       'Centenario', 'Cabildo', 'Quequen', 'Casbas', 'Ingeniero Huergo',
       'General Pico', 'General Villegas', 'Fernandez Oro',
       'Monte Hermoso', 'Mayor Buratovich', 'Médanos', 'Villalonga',
       'Bolivar', 'Henderson', 'Laprida', 'Chimpay', 'Alta Gracia',
       'Villa Carlos Paz', 'Villa General Belgrano',
       'Santa Rosa De Calamuchita', 'Caseros', 'Adrogue', 'Tablada',
       'Ituizango', 'Lomas Del Mirador', 'Pablo Podesta', 'Chascomus',
       'Rafael Calzada', 'Martin Coronado', 'Dolores', 'Villa Tesei',
       'General Rodriguez', 'Ensenada', 'Jose C. Paz', 'San Vicente',
       'Gualeguay', 'Villaguay', 'Chajari', 'Bell Ville', 'Marcos Juarez',
       'Parana-Entre Rios', 'La Paz', 'Concepc Del Uruguay',
       'Rio Tercero', 'Santa Fe', 'Villa Maria', 'Esquina',
       'Monte Caseros', 'Curuzu-Cuatia', 'Santo Tome', 'Goya',
       'Luis Guillon', 'Arroyito', 'Mercedes', 'Bella Vista (Ctes.)',
       'Miramar', 'Trujui', 'Ingeniero Maschwitz', '9 De Abril',
       'La Reja', 'Llavallol', 'Adolfo Sourdeaux', 'Matheu',
       'Villa Madero', 'Claypole', 'Villa Bosch', 'Benavidez', 'Crespo',
       'Federacion', 'Federal', 'Monte', 'Colon',
       'San Francisco Dpto S Just', 'Almafuerte', 'Villa Del Rosario',
       'Hernando', 'La Carlota', 'Oncativo', 'Diamante', 'Leones',
       'Ramirez', 'Loberia', 'Virreyes', 'Boulogne',
       'San Antonio De Areco', 'Mar Del Plata', 'San Francisco Solano',
       'Coronel Brandsen', 'Francisco Alvarez', 'Maq Francisco Savio',
       'Loma Verde', 'Ingeniero Pablo Nogues', 'Villa Rosa', 'Maipu',
       'Ranchos', 'Las Flores', 'Villa Constitucion', 'Bragado', 'Zarate',
       'Capitan Sarmiento', 'Firmat', '25 De Mayo', 'Rafael Castillo',
       'Carlos Casares', 'Los Toldos', 'Rojas', 'Arrecifes', 'Chivilcoy',
       'General Belgrano', 'Roque Perez', 'Navarro', 'Lobos', 'Ayacucho',
       'San Andres De Giles', 'San Pedro', 'General Madariaga',
       'Jose Manuel Marmol', 'San Nicolas', 'Chacabuco', 'Arroyo Seco',
       'Daireaux', 'Olavarria', 'Pehuajo', 'Carmen De Areco', 'Nogoya',
       'Rosario Del Tala', 'Villa San Jose', 'Villa Elisa', 'CaÃ±uelas',
       'Gral Pinto', 'America', 'Berisso', 'Funes', 'Rauch', 'Viale',
       'Coronel Vidal', 'Lujan', 'Macia', 'El Palomar', 'Las Heras',
       'Bovril', 'General Galarza', 'Santa Elena Dpto La Paz',
       'San Salvador', 'Villa Hernandarias', 'Colonia Cerrito',
       'Loma Hermosa', 'Laferrere', 'Tortuguitas', 'Aldo Bonzi',
       'Virrey Del Pino', 'El Jaguel Pdo Esteb Eche',
       'Joaquin V Gonzalez', 'Metan', 'Jose Leon Suarez', 'Alberti',
       'Alejandro Korn', 'Paso Del Rey', 'La Banda', 'Capital', 'Posadas',
       'Rafaela', 'San Miguel de Tucuman', 'Resisitencia', 'Rawson',
       'Villa Nueva', 'Sampacho', 'Juana Koslay', 'La Punta', 'ZARATE',
       'ANTEQUERAS', 'RIO NEGRO', 'LAS FLORES', 'USPALLATA',
       'San Carlos de Bariloche', 'Esquel', 'El Bolson', 'Caleta Olivia',
       'Rio Gallegos', 'Rio Grande', 'San Antonio Oeste',
       'Carmen de Patagones', 'Plaza Huincul', 'Junin', 'Salto',
       'Puerto Deseado', 'Lincoln', 'San Martin de los Andes',
       'Sarmiento', 'Rufino', 'Florentino Ameghino', 'Laboulaye',
       'El Calafate', 'Yacimientos Rio Turbio', 'Pico Truncado',
       'Junin de los Andes', 'Intendente Alvear', 'Esperanza',
       'San Jorge', 'Sierra Grande', 'Trevelin', 'Rincon de los Sauces',
       'Villa la Angostura', 'Rada Tilly', 'Playa Union', 'Piedra Buena',
       'Eduardo Castex', 'San Julian', 'Gobernador Gregores',
       '28 de Noviembre', 'Gaiman', 'Las Grutas', 'Tolhuin',
       'Perito Moreno', 'Rio Colorado', 'Morteros', 'Lago Puelo',
       'Puerto Santa Cruz', 'Marcos Juares', 'Aguada San Roque',
       'Pinamar', 'Ciudad Autonoma de Buenos Aires', 'Esteban Echeverria',
       'Matanza', 'General Pueyrredon', 'Cordoba', 'Villa Allende',
       'General San Martin', 'ARROYO SECO',
       'SAN ISIDRO ,PTDO. SAN ISIDRO', 'LA PLATA', 'MONTE GRANDE',
       'MERLO', 'SAN MIGUEL', 'LOMAS DE ZAMORA', 'QUILMES', 'OLIVOS',
       'FLORENCIO VARELA', 'VIRREYES', 'CASEROS ,PARTIDO 3 DE FEBRERO',
       'RAMOS MEJIA', 'BANFIELD', 'ADROGUE', 'CAMPANA',
       'SAN FRANCISCO SOLANO', 'MUNRO', 'JOSE C. PAZ', 'GRAND BOURG',
       'HURLINGHAM', 'SAN MARTIN. PTO.GRAL SAN MARTIN', 'MAR DEL PLATA',
       'Barracas', 'CAPITAL FEDERAL', 'MARTINEZ', 'SAN ISIDRO',
       'CHASCOMUS', 'ITUZAINGO', 'CIUDADELA', 'ACASSUSO', 'PINAMAR',
       'DEL VISO', 'LAS ARMAS', 'TRISTAN SUAREZ', 'BERAZATEGUI',
       'ENSENADA', 'GERLI', 'REMEDIOS DE ESCALADA', 'Capitán Sarmiento',
       'Saladillo', 'General Alvear', '25 de Mayo', 'Tapalque',
       'Carmen de Patagones ', 'Stroeder            ',
       'San Salvador de Jujuy', 'Perico', 'San Pedro de Jujuy',
       'Libertador Gral. San Martin', 'Palpala',
       'San Ramon de la Nueva Oran', 'S.F.Solano', 'CABA',
       'VILLA DOLORES', 'RIO SEGUNDO', 'VILLA ALLENDE', 'CORDOBA',
       'DEAN FUNES', 'LAS VARILLAS', 'STA.ROSA CALAMUCHITA', 'RECREO',
       'FRIAS', 'LA FALDA', 'MORTEROS', 'RIO CEBALLOS', 'CARLOS PAZ',
       'CURA BROCHERO', 'MINA CLAVERO', 'CAPILLA DEL MONTE', 'UNQUILLO',
       'LA CUMBRE', 'VILLA DEL ROSARIO', 'JESUS MARIA', 'jesus maria',
       'CRUZ DEL EJE', 'Valle Hermoso', 'ORAN', 'SAN ANTONIO DE PADUA',
       'CASTELAR', 'MERCEDES', 'VILLA NUEVA DE GUAYMALLEN', 'LAS HERAS',
       'MENDOZA', 'TUNUYAN', 'SAN RAFAEL', 'LUJAN DE CUYO', 'VILLA MARIA',
       'SAN FDO DEL VALLE DE CATAMARCA', 'RODEO DE LA CRUZ', 'FUNES',
       'SAN FRANCISCO', 'BELL VILLE', 'MARCOS JUAREZ',
       'SAN CLEMENTE DEL TUYU', 'TUPUNGATO', 'EUGENIO BUSTOS', 'ROJAS',
       'SALADILLO', 'CHAJARI', 'GUALEGUAYCHU', 'RIO TERCERO',
       'PASO DE LOS LIBRES', 'GENERAL PACHECO', 'YERBA BUENA', 'LOBOS',
       'CAÑUELAS', 'TRES ARROYOS', 'TANDIL', 'TAFI VIEJO', 'LEDESMA',
       'CHIVILCOY', 'GENERAL ALVEAR', 'CONCORDIA',
       'SAN JOSE DE GUAYMALLEN', 'MONTEROS VIEJO',
       'JUAN BAUTISTA ALBERDI', 'MALARGUE', 'TAPIALES', 'MIRAMAR',
       'CITY BELL', 'BELLA VISTA', 'VILLA CARLOS PAZ',
       'SAN BERNARDO DEL TUYU', 'VICENTE LOPEZ', 'VILLA GESELL',
       'COSQUIN', 'TORTUGUITAS', 'ALTA GRACIA', 'CANNING',
       'VENADO TUERTO', 'ZONA DELTA TIGRE', 'LLAVALLOL',
       'VILLA BALLESTER', 'QUILMES OESTE', 'BELEN DE ESCOBAR', 'ROSARIO',
       'CARRODILLA  LA PUNTILLA'], dtype=object)

In [102]:
Sucursal.localidad = Sucursal.localidad.str.title() # I normalize the localities names

In [103]:
pd.unique(Sucursal.localidad)

array(['Salsipuedes', 'San Isidro', 'Hurlingham', 'Malvinas Argentinas',
       'Salta', 'San Justo', 'San Juan', 'Comodoro Rivadavia',
       'General Roca', 'Olavarría', 'Río Grande', 'Santa Rosa',
       'Bariloche', 'San Martín', 'San Nicolás', 'Neuquén', 'Corrientes',
       'Monte Grande', 'Ushuaia', 'Trelew', 'Guaymallen',
       'San Fernando Del Valle De Catamarca', 'Puerto Madryn', 'Rosario',
       'Maschwitz', 'Vicente López', 'Olivos', 'Moreno', 'Zárate',
       'Ciudad Autónoma De Buenos Aires', 'San Miguel', 'Mar Del Plata',
       'Bernal', 'Pergamino', 'Adrogué', 'Lomas De Zamora', 'Campana',
       'Concordia', 'Don Torcuato', 'Villa Mercedes', 'General Pacheco',
       'Jardin Espinoza', 'Gualeguaychu', 'Luján', 'San Fernando',
       'Venado Tuerto', 'Pilar', 'Mendoza', 'Ituzaingó',
       'General Rodríguez', 'Tandil', 'Temperley', 'Merlo', 'Haedo',
       'Resistencia', 'San Miguel De Tucumán', 'Martín Coronado',
       'Río Gallegos', 'Florencio Varela', 'Quintas De Arguello', 'Tigre',
       'Villa Allende Lomas', 'Formosa', 'Glew', 'Balcarce', 'Santa Cruz',
       'Quilmes', 'La Plata', 'Villa Urquiza', 'Avellaneda',
       'Bahía Blanca', 'Río Cuarto', 'Jujuy', 'Paraná', 'La Rioja',
       'San Luis', 'Lanús', 'Escobar', 'Carapachay', 'Chilavert',
       'Ciudad Jardín Del Palomar', 'Martínez', 'Villa Ballester',
       'Acassuso', 'José León Suárez', 'Tupungato', 'Luján De Cuyo',
       'Godoy Cruz', 'Alto Verde', 'Yerba Buena', 'Jose León Suárez',
       'Adolfo Sordeaux', 'Victoria', 'Del Viso', 'Maquinista Savio',
       'Villa Adelina', 'Beccar', 'Los Polvorines', 'Castelar', 'Munro',
       'Morón', 'Don Bosco', 'Monte Chingolo', 'Burzaco', 'Longchamps',
       'Almirante Brown', 'Ezpeleta', 'Banfield', 'Gerli',
       'Remedios De Escalada', 'Budge', 'Valentín Alsina', 'Wilde',
       'Isidro Casanova', 'Villa Bosh', 'Gregorio De Laferrere',
       'Ramos Mejía', 'Villa Celina', 'La Matanza', 'Palomar', 'Tapiales',
       'San Antonio De Padua', 'Paso Del Rey', 'Grand Bourg',
       'Berazategui', 'Ezeiza', '3 De Febrero', 'Córdoba', 'Derqui',
       'Santiago Del Estero', 'Maipu', 'Neuquen',
       'San Carlos De Bariloche', 'San Salvador De Jujuy',
       'Ingeniero Pablo Nogues', 'Banda Del Rio Sali', 'Caseros',
       'Cipolletti', 'Parana', 'Lanus', 'Posadas',
       'San Ramon De La Nueva Oran', 'Viedma', 'Villa Nueva',
       'Gonzalez Catan', 'Barrio Matienzo *', 'Junin',
       'General San Martin', 'Goya', 'Barrio Castañares', 'General Pico',
       'Tartagal', 'Barrio Rawson', 'San Miguel De Tucuman', 'Concepcion',
       'Barrio Aeronautico *', 'Presidencia Roque Saenz Peña', 'Claypole',
       'San Pedro', 'Clorinda', 'Moron', 'Ciudad Autonoma Buenos Aires',
       'Jose Clemente Paz', 'San Martin', 'Williams Morris *',
       'Villa Santos Tesei', 'San Vicente', 'Rio Cuarto',
       'Mendoza Ciudad', 'Barrio Rivadavia', 'Ciudad De Cordoba Norte',
       'Lujan', 'Sarandi', 'Tablada', 'Barrio El Dorado', 'Olavarria',
       'Santos Lugares', 'La Plata Noroeste De La Calle 50',
       'Bahia Blanca', 'Santa Fe', 'Villanueva', 'Capital Federal',
       'V Illa Lugano', 'Caballito', 'Ciudad De Santa Fe', 'Lugano',
       'Bella Vista', 'Cdad. De Bs.As', 'Ciudadela', 'Jose C Paz',
       'Parque Chacabuco', 'Gral Madariaga', 'Cuidad De Santa Fe', 'Once',
       'Saavedra', 'Vicente Lopez', 'Constitucion', 'La Horqueta',
       'Garin', 'Paternal', 'Belgrano', 'Barrio Norte', 'General Lavalle',
       'Caba', 'Palermo', 'San Telmo', 'Villa Devoto', 'Florida',
       'Liniers', 'Flores Sur', 'Almagro', 'Boedo', 'Flores',
       'Mar De Ajo', 'Ramos Mejia', 'Devoto', 'Floresta', 'Tribunales',
       'Pompeya', 'Las Lomas', 'Punta Chica', 'Parque Patricios',
       'San Cristobal', 'Villa Crespo', 'Villa Luro', 'Mataderos',
       'Abasto', 'Vte Lopez', 'Fisherton', 'Plottier', 'Choele Choel',
       'Lamarque', 'Luis Beltran', 'Trenque Lauquen', 'Catriel',
       'Pehuajó', 'Allen', 'Zapala', '9 De Julio', 'Lobería', 'Cutral Co',
       'Batán', 'Cinco Saltos', 'Andacollo', 'Loncopué',
       'San Martín De Los Andes', 'Las Lajas', 'Villa Gesell',
       'Chos Malal', 'Junín De Los Andes', 'Necochea', 'Pedro Luro',
       'Guatrache', 'Punta Alta', 'Azul', 'Pigue', 'Coronel Dorrego',
       'Coronel Suarez', 'Tres Arroyos', 'Coronel Pringles',
       'General Cerri', 'Puan', 'Benito Juarez', 'Tornquist',
       'Río Colorado', 'General Acha', 'General Lamadrid', 'Villa Regina',
       'Puerto Belgrano', 'Centenario', 'Cabildo', 'Quequen', 'Casbas',
       'Ingeniero Huergo', 'General Villegas', 'Fernandez Oro',
       'Monte Hermoso', 'Mayor Buratovich', 'Médanos', 'Villalonga',
       'Bolivar', 'Henderson', 'Laprida', 'Chimpay', 'Alta Gracia',
       'Villa Carlos Paz', 'Villa General Belgrano',
       'Santa Rosa De Calamuchita', 'Adrogue', 'Ituizango',
       'Lomas Del Mirador', 'Pablo Podesta', 'Chascomus',
       'Rafael Calzada', 'Martin Coronado', 'Dolores', 'Villa Tesei',
       'General Rodriguez', 'Ensenada', 'Jose C. Paz', 'Gualeguay',
       'Villaguay', 'Chajari', 'Bell Ville', 'Marcos Juarez',
       'Parana-Entre Rios', 'La Paz', 'Concepc Del Uruguay',
       'Rio Tercero', 'Villa Maria', 'Esquina', 'Monte Caseros',
       'Curuzu-Cuatia', 'Santo Tome', 'Luis Guillon', 'Arroyito',
       'Mercedes', 'Bella Vista (Ctes.)', 'Miramar', 'Trujui',
       'Ingeniero Maschwitz', '9 De Abril', 'La Reja', 'Llavallol',
       'Adolfo Sourdeaux', 'Matheu', 'Villa Madero', 'Villa Bosch',
       'Benavidez', 'Crespo', 'Federacion', 'Federal', 'Monte', 'Colon',
       'San Francisco Dpto S Just', 'Almafuerte', 'Villa Del Rosario',
       'Hernando', 'La Carlota', 'Oncativo', 'Diamante', 'Leones',
       'Ramirez', 'Loberia', 'Virreyes', 'Boulogne',
       'San Antonio De Areco', 'San Francisco Solano', 'Coronel Brandsen',
       'Francisco Alvarez', 'Maq Francisco Savio', 'Loma Verde',
       'Villa Rosa', 'Ranchos', 'Las Flores', 'Villa Constitucion',
       'Bragado', 'Zarate', 'Capitan Sarmiento', 'Firmat', '25 De Mayo',
       'Rafael Castillo', 'Carlos Casares', 'Los Toldos', 'Rojas',
       'Arrecifes', 'Chivilcoy', 'General Belgrano', 'Roque Perez',
       'Navarro', 'Lobos', 'Ayacucho', 'San Andres De Giles',
       'General Madariaga', 'Jose Manuel Marmol', 'San Nicolas',
       'Chacabuco', 'Arroyo Seco', 'Daireaux', 'Pehuajo',
       'Carmen De Areco', 'Nogoya', 'Rosario Del Tala', 'Villa San Jose',
       'Villa Elisa', 'Caã±Uelas', 'Gral Pinto', 'America', 'Berisso',
       'Funes', 'Rauch', 'Viale', 'Coronel Vidal', 'Macia', 'El Palomar',
       'Las Heras', 'Bovril', 'General Galarza',
       'Santa Elena Dpto La Paz', 'San Salvador', 'Villa Hernandarias',
       'Colonia Cerrito', 'Loma Hermosa', 'Laferrere', 'Tortuguitas',
       'Aldo Bonzi', 'Virrey Del Pino', 'El Jaguel Pdo Esteb Eche',
       'Joaquin V Gonzalez', 'Metan', 'Jose Leon Suarez', 'Alberti',
       'Alejandro Korn', 'La Banda', 'Capital', 'Rafaela', 'Resisitencia',
       'Rawson', 'Sampacho', 'Juana Koslay', 'La Punta', 'Antequeras',
       'Rio Negro', 'Uspallata', 'Esquel', 'El Bolson', 'Caleta Olivia',
       'Rio Gallegos', 'Rio Grande', 'San Antonio Oeste',
       'Carmen De Patagones', 'Plaza Huincul', 'Salto', 'Puerto Deseado',
       'Lincoln', 'San Martin De Los Andes', 'Sarmiento', 'Rufino',
       'Florentino Ameghino', 'Laboulaye', 'El Calafate',
       'Yacimientos Rio Turbio', 'Pico Truncado', 'Junin De Los Andes',
       'Intendente Alvear', 'Esperanza', 'San Jorge', 'Sierra Grande',
       'Trevelin', 'Rincon De Los Sauces', 'Villa La Angostura',
       'Rada Tilly', 'Playa Union', 'Piedra Buena', 'Eduardo Castex',
       'San Julian', 'Gobernador Gregores', '28 De Noviembre', 'Gaiman',
       'Las Grutas', 'Tolhuin', 'Perito Moreno', 'Rio Colorado',
       'Morteros', 'Lago Puelo', 'Puerto Santa Cruz', 'Marcos Juares',
       'Aguada San Roque', 'Pinamar', 'Ciudad Autonoma De Buenos Aires',
       'Esteban Echeverria', 'Matanza', 'General Pueyrredon', 'Cordoba',
       'Villa Allende', 'San Isidro ,Ptdo. San Isidro',
       'Caseros ,Partido 3 De Febrero', 'San Martin. Pto.Gral San Martin',
       'Barracas', 'Martinez', 'Ituzaingo', 'Las Armas', 'Tristan Suarez',
       'Capitán Sarmiento', 'Saladillo', 'General Alvear', 'Tapalque',
       'Carmen De Patagones ', 'Stroeder            ', 'Perico',
       'San Pedro De Jujuy', 'Libertador Gral. San Martin', 'Palpala',
       'S.F.Solano', 'Villa Dolores', 'Rio Segundo', 'Dean Funes',
       'Las Varillas', 'Sta.Rosa Calamuchita', 'Recreo', 'Frias',
       'La Falda', 'Rio Ceballos', 'Carlos Paz', 'Cura Brochero',
       'Mina Clavero', 'Capilla Del Monte', 'Unquillo', 'La Cumbre',
       'Jesus Maria', 'Cruz Del Eje', 'Valle Hermoso', 'Oran',
       'Villa Nueva De Guaymallen', 'Tunuyan', 'San Rafael',
       'Lujan De Cuyo', 'San Fdo Del Valle De Catamarca',
       'Rodeo De La Cruz', 'San Francisco', 'San Clemente Del Tuyu',
       'Eugenio Bustos', 'Paso De Los Libres', 'Cañuelas', 'Tafi Viejo',
       'Ledesma', 'San Jose De Guaymallen', 'Monteros Viejo',
       'Juan Bautista Alberdi', 'Malargue', 'City Bell',
       'San Bernardo Del Tuyu', 'Cosquin', 'Canning', 'Zona Delta Tigre',
       'Quilmes Oeste', 'Belen De Escobar', 'Carrodilla  La Puntilla'],
      dtype=object)

In [104]:
pd.unique(Sucursal.banderaDescripcion) # There are many fantasy names in upper case

array(['Super MAMI', 'Hipermercado Carrefour', 'Market', 'Express',
       'Changomas', 'Mi Changomas', 'Walmart SuperCenter', 'COTO CICSA',
       'Cooperativa Obrera Limitada de Consumo y Vivienda',
       'Supermercados Becerra', 'Supermercados DIA',
       'Hipermercado Libertad', 'Mini Libertad', 'Atomo', 'Super Aiello',
       'FULL', 'La Anonima', 'Topsy', 'Bomba',
       'LA AGRICOLA REGIONAL COOPERATIVA LIMITADA', 'Toledo',
       'Axion Energy', 'Simplicity', 'LA AMISTAD',
       'JOSIMAR SUPERMERCADOS', 'DEHEZA S.A.I.C.F. e I.',
       'MUCOOP CAP.SARMIENTO', 'SuperCLC', 'ESTACION LIMA S.A.',
       'SUPERMERCADOS EL NENE', 'ALMACENES PAMPAS', 'ALMACENES DE MARCA',
       'Sup. Unicoop        ', 'Super Tuti1 y Super Tuti 3',
       'California Supermercados', 'Super Tuti2 y Super Todo',
       'Supermercados Comodin', 'Maxi Comodin', 'Diarco',
       'Supermercados Cordiez', 'Abastecimiento Mercamax', 'Mariano Max',
       'Vea', 'Disco', 'Jumbo'], dtype=object)

In [105]:
Sucursal.banderaDescripcion = Sucursal.banderaDescripcion.str.title() # I normalize them

In [106]:
pd.unique(Sucursal.banderaDescripcion)

array(['Super Mami', 'Hipermercado Carrefour', 'Market', 'Express',
       'Changomas', 'Mi Changomas', 'Walmart Supercenter', 'Coto Cicsa',
       'Cooperativa Obrera Limitada De Consumo Y Vivienda',
       'Supermercados Becerra', 'Supermercados Dia',
       'Hipermercado Libertad', 'Mini Libertad', 'Atomo', 'Super Aiello',
       'Full', 'La Anonima', 'Topsy', 'Bomba',
       'La Agricola Regional Cooperativa Limitada', 'Toledo',
       'Axion Energy', 'Simplicity', 'La Amistad',
       'Josimar Supermercados', 'Deheza S.A.I.C.F. E I.',
       'Mucoop Cap.Sarmiento', 'Superclc', 'Estacion Lima S.A.',
       'Supermercados El Nene', 'Almacenes Pampas', 'Almacenes De Marca',
       'Sup. Unicoop        ', 'Super Tuti1 Y Super Tuti 3',
       'California Supermercados', 'Super Tuti2 Y Super Todo',
       'Supermercados Comodin', 'Maxi Comodin', 'Diarco',
       'Supermercados Cordiez', 'Abastecimiento Mercamax', 'Mariano Max',
       'Vea', 'Disco', 'Jumbo'], dtype=object)

In [107]:
Sucursal.sucursalNombre = Sucursal.sucursalNombre.str.title() # Just in case I normalize this
                                                              # column as well

In [108]:
pd.unique(Sucursal.provincia) # I see which states there are

array(['AR-X', 'AR-B', 'AR-A', 'AR-J', 'AR-U', 'AR-R', 'AR-V', 'AR-L',
       'AR-Q', 'AR-W', 'AR-M', 'AR-K', 'AR-S', 'AR-C', 'AR-E', 'AR-D',
       'AR-H', 'AR-T', 'AR-Z', 'AR-P', 'AR-Y', 'AR-F', 'AR-G', 'AR-N'],
      dtype=object)

In [109]:
Sucursal.provincia.nunique() # I count the total amount

24

In [110]:
Sucursal.head() # I could rename some of the columns names

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super Mami,Dinosaurio S.A.,AR-X,Salsipuedes,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [111]:
Sucursal.rename(columns={'id':'sucursal_id', 
                 'comercioId':'comercio_id',
                 'banderaId':'bandera_id',
                 'banderaDescripcion':'bandera_desc',
                 'comercioRazonSocial':'comercio_razon_social',
                 'sucursalNombre':'sucursal_nombre',
                 'sucursalTipo':'sucursal_tipo'}, inplace=True) 
# I rename some columns

In [112]:
Sucursal.head()

,sucursal_id,comercio_id,bandera_id,bandera_desc,comercio_razon_social,provincia,localidad,direccion,lat,lng,sucursal_nombre,sucursal_tipo
0,1-1-7,1,1,Super Mami,Dinosaurio S.A.,AR-X,Salsipuedes,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [113]:
Sucursal_ids_repetidos = Sucursal[Sucursal.sucursal_id.duplicated()] 
# I create a dataframe to check if there are any duplicated ids

In [114]:
Sucursal_ids_repetidos # no duplicated ids

Empty DataFrame
Columns: [sucursal_id, comercio_id, bandera_id, bandera_desc, comercio_razon_social, provincia, localidad, direccion, lat, lng, sucursal_nombre, sucursal_tipo]
Index: []

In [115]:
Sucursal.sucursal_id.isna().sum() # I look for missing values

0

In [116]:
Sucursal.sucursal_id = Sucursal.sucursal_id.str.replace('-', '') 
# I erase the middle dash from the ids

In [119]:
Sucursal.head(5)

,sucursal_id,comercio_id,bandera_id,bandera_desc,comercio_razon_social,provincia,localidad,direccion,lat,lng,sucursal_nombre,sucursal_tipo
0,117,1,1,Super Mami,Dinosaurio S.A.,AR-X,Salsipuedes,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,1011,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10110,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10111,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,101112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [118]:
Sucursal.sucursal_id = Sucursal.sucursal_id.astype(int) 
# I convert the id column to integer

## Now I check the weekly sales datasets

## precios_semana_20200518

In [7]:
precios_semana_20200518.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 415293 entries, 0 to 415292
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       413333 non-null  float64
 1   producto_id  415287 non-null  object
 2   sucursal_id  415287 non-null  object
dtypes: float64(1), object(2)
memory usage: 9.5+ MB

In [8]:
precios_semana_20200518.head() # It has the product's id prior to the transformation

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

In [9]:
precios_semana_20200518.producto_id = precios_semana_20200518.producto_id.str.replace('-','') 
# I erase the middle dash

In [169]:
precios_semana_20200518.producto_id = precios_semana_20200518.producto_id.astype(np.int64) 
# I convert the ids in integer

ValueError: cannot convert float NaN to integer

In [10]:
precios_semana_20200518.producto_id.fillna('0', inplace=True) # There where "None" values in the id
                                                              # so it wouldn´t let me make them integers,
                                                              # so I replace them with zeros

In [11]:
precios_semana_20200518.producto_id = precios_semana_20200518.producto_id.astype(np.int64) 
# I convert the ids to integer

In [12]:
precios_semana_20200518.head()

   precio  producto_id sucursal_id
0   29.90         2288     2-1-009
1   32.90         2288     2-1-037
2   36.90         2288     2-1-090
3   39.90         2288     2-3-247
4  499.99       205870     9-1-430

In [13]:
precios_semana_20200518[precios_semana_20200518.producto_id == 0]
# There are NaN values in "sucursal_id" that I could replace for "Sin dato"

        precio  producto_id sucursal_id
375118   203.0            0         NaN
375157     NaN            0         NaN
375193   240.0            0         NaN
375278     NaN            0         NaN
375357     NaN            0         NaN
375397     NaN            0         NaN

In [14]:
precios_semana_20200518.sucursal_id.fillna('Sin Dato', inplace=True) 
# I fill the missing values with 'Sin dato'

In [15]:
precios_semana_20200518[precios_semana_20200518.producto_id == 0]
# I check that it changed

        precio  producto_id sucursal_id
375118   203.0            0    Sin Dato
375157     NaN            0    Sin Dato
375193   240.0            0    Sin Dato
375278     NaN            0    Sin Dato
375357     NaN            0    Sin Dato
375397     NaN            0    Sin Dato

In [16]:
precios_semana_20200518.precio.fillna(0, inplace=True) 
# I fill the missing values in price for zero

In [17]:
precios_semana_20200518[precios_semana_20200518.producto_id == 0]
# I check that it changed

        precio  producto_id sucursal_id
375118   203.0            0    Sin Dato
375157     0.0            0    Sin Dato
375193   240.0            0    Sin Dato
375278     0.0            0    Sin Dato
375357     0.0            0    Sin Dato
375397     0.0            0    Sin Dato

In [21]:
precios_semana_20200518[precios_semana_20200518.producto_id == 0].count()
# I count how many entries are missing the product_id, since there are a few I'll drop them

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [18]:
precios_semana_sin_producto = precios_semana_20200518[precios_semana_20200518.producto_id == 0].index

In [19]:
precios_semana_20200518.drop(precios_semana_sin_producto, inplace=True)

In [20]:
precios_semana_20200518.head()

   precio  producto_id sucursal_id
0   29.90         2288     2-1-009
1   32.90         2288     2-1-037
2   36.90         2288     2-1-090
3   39.90         2288     2-3-247
4  499.99       205870     9-1-430

## I check the "precios_semana_20200503" dataset

In [54]:
precios_semana_20200503.info() # All columns are strings

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397734 entries, 0 to 397733
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       397734 non-null  object
 1   producto_id  397734 non-null  object
 2   sucursal_id  397734 non-null  object
dtypes: object(3)
memory usage: 9.1+ MB

In [84]:
precios_semana_20200503.head()

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-187
1   39.90  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59

In [83]:
precios_semana_20200503.precio = precios_semana_20200503.precio.str.replace('','0').fillna(precios_semana_20200503.precio).astype(float)
# I replace the empty values for zero
# and I convert the column to float

In [80]:
precios_semana_20200503[precios_semana_20200503.precio == ''].count()
# I check how many products have no price

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [85]:
precios_semana_20200503[precios_semana_20200503.precio == '']
# I make sure there are not empty values

Empty DataFrame
Columns: [precio, producto_id, sucursal_id]
Index: []

In [86]:
precios_semana_20200503.producto_id = precios_semana_20200503.producto_id.str.replace('-','') 
# I erase the middle dash from the id

In [88]:
precios_semana_20200503.producto_id.fillna('0', inplace=True) # There were "None" values in the id
                                                              # so it wouldn´t let me make them integers,
                                                              # so I replace them with zeros

In [89]:
precios_semana_20200503.producto_id = precios_semana_20200503.producto_id.astype(np.int64) 
# I convert the ids to integer

In [90]:
precios_semana_20200503.sucursal_id.fillna('Sin Dato', inplace=True) 
# I fill the missing values with 'Sin dato'

In [92]:
precios_semana_sin_producto = precios_semana_20200503[precios_semana_20200503.producto_id == 0]
precios_semana_sin_producto.info() # There are many products with no id

<class 'pandas.core.frame.DataFrame'>
Int64Index: 375262 entries, 13466 to 397733
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       375262 non-null  float64
 1   producto_id  375262 non-null  int64
 2   sucursal_id  375262 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [97]:
precios_semana_sin_producto[precios_semana_sin_producto.precio == 80]

        precio  producto_id sucursal_id
13468     80.0            0     10-1-18
13478     80.0            0    10-2-176
13485     80.0            0   16-1-1502
13491     80.0            0      44-1-8
13492     80.0            0      45-1-5
...        ...          ...         ...
397623    80.0            0   16-1-1402
397639    80.0            0      7-1-35
397641    80.0            0     9-1-860
397644    80.0            0     9-2-233
397646    80.0            0    9-3-5222

[1203 rows x 3 columns]

In [99]:
precios_semana_sin_producto = precios_semana_20200503[precios_semana_20200503.producto_id == 0].index

In [100]:
precios_semana_20200503.drop(precios_semana_sin_producto, inplace=True)
# I drop them since I see no way of correlationate them to any price

In [101]:
precios_semana_20200503.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22472 entries, 0 to 397604
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   precio       22472 non-null  float64
 1   producto_id  22472 non-null  int64
 2   sucursal_id  22472 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 702.2+ KB

In [102]:
precios_semana_20200503.head(5) # It seems everything is in order

   precio  producto_id sucursal_id
0   29.90         2288     2-1-187
1   39.90         2288     2-3-247
2  499.99       205870     9-1-685
3  539.99       205870      9-2-22
4  519.99       205870      9-2-59

## I work the "precios_semana_20200426" dataset

In [5]:
precios_semana_20200426.info() # I have to modify the "sucursal" and "producto id" columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478909 entries, 0 to 478908
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       477173 non-null  float64
 1   sucursal_id  478909 non-null  object
 2   producto_id  465390 non-null  float64
dtypes: float64(2), object(1)
memory usage: 11.0+ MB

In [21]:
precios_semana_20200426.head(5)

    precio sucursal_id  producto_id
0    399.0     2-1-092       2288.0
1    299.0     2-1-206       2288.0
2    399.0     2-2-241       2288.0
3  49999.0     9-1-430     205870.0
4  53999.0       9-2-4     205870.0

I work on the price column first

In [22]:
precios_semana_20200426.precio.isna().sum() # There are missing values

0

In [15]:
precios_semana_20200426.precio.fillna(0, inplace=True) 
# I fill the missing values with zero

I work on the "producto_id" column

In [29]:
precios_semana_20200426.producto_id.isna().sum() # There are missing values

13519

In [28]:
precios_semana_20200426.producto_id.dropna(inplace=True) # I drop the missing values

In [33]:
precios_semana_20200426[precios_semana_20200426.producto_id == precios_semana_20200426.producto_id.isna()]

Empty DataFrame
Columns: [precio, sucursal_id, producto_id]
Index: []

In [36]:
precios_semana_sin_productoid = precios_semana_20200426[precios_semana_20200426.producto_id.isna()].index 
# I create an product_id None index

In [37]:
precios_semana_20200426.drop(precios_semana_sin_productoid, inplace=True) 
# I use the index to drop the columns with missing ids

In [38]:
precios_semana_20200426[precios_semana_20200426.producto_id.isna()] # I check that are not missing values left

Empty DataFrame
Columns: [precio, sucursal_id, producto_id]
Index: []

In [16]:
precios_semana_20200426.producto_id = precios_semana_20200426.producto_id.astype(str)
# I convert the column to string

In [17]:
precios_semana_20200426.producto_id = precios_semana_20200426.producto_id.str.replace('-','') 
# I erase the middle dash

In [18]:
precios_semana_20200426.producto_id.fillna('0', inplace=True) # There were "None" values in the id
                                                              # so it wouldn´t let me make them integers,
                                                              # so I replace them with zeros

In [19]:
precios_semana_20200426.producto_id = precios_semana_20200426.producto_id.astype(float) 
# I convert the ids to float

In [39]:
precios_semana_20200426.producto_id = precios_semana_20200426.producto_id.astype(np.int64) 
# I convert the ids to integer

In [40]:
precios_semana_20200426.head(5)

    precio sucursal_id  producto_id
0    399.0     2-1-092         2288
1    299.0     2-1-206         2288
2    399.0     2-2-241         2288
3  49999.0     9-1-430       205870
4  53999.0       9-2-4       205870

In [41]:
precios_semana_20200426.info() # Everything in order

<class 'pandas.core.frame.DataFrame'>
Int64Index: 465390 entries, 0 to 478908
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       465390 non-null  float64
 1   sucursal_id  465390 non-null  object
 2   producto_id  465390 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.2+ MB

## "precios_semana_20200419" dataset

In [13]:
precios_semana_20200419.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458543 entries, 0 to 458542
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       456736 non-null  float64
 1   sucursal_id  458543 non-null  object
 2   producto_id  458543 non-null  object
dtypes: float64(1), object(2)
memory usage: 10.5+ MB

In [14]:
precios_semana_20200419.head(5)

   precio          sucursal_id producto_id
0   29.90              2-1-184        2288
1   39.90              2-1-206        2288
2  499.99              9-1-430      205870
3  539.99              9-2-107      205870
4  539.99  5218-03-09 00:00:00      205870

I work on the product_id column

In [15]:
precios_semana_20200419.producto_id = precios_semana_20200419.producto_id.str.replace('-','') # I erase the middle dash

In [16]:
precios_semana_20200419.producto_id.isna().sum() # there are missing values

445975

In [17]:
precios_semana_20200419[precios_semana_20200419.producto_id.isna()]

        precio          sucursal_id producto_id
0        29.90              2-1-184         NaN
1        39.90              2-1-206         NaN
2       499.99              9-1-430         NaN
3       539.99              9-2-107         NaN
4       539.99  5218-03-09 00:00:00         NaN
...        ...                  ...         ...
458538  139.99  2001-01-25 00:00:00         NaN
458539   34.99  2001-01-25 00:00:00         NaN
458540  312.50  2003-01-05 00:00:00         NaN
458541  312.50  2003-01-05 00:00:00         NaN
458542  198.90  2003-01-05 00:00:00         NaN

[445975 rows x 3 columns]

In [18]:
precios_semana_sin_productoid = precios_semana_20200419[precios_semana_20200419.producto_id.isna()].index 
# I create the index to the product_id missing values

In [19]:
precios_semana_20200419.drop(precios_semana_sin_productoid, inplace=True) # I drop the entries with missing id

In [20]:
precios_semana_20200419.producto_id = precios_semana_20200419.producto_id.astype(np.int64) 
# I convert the id column to integer

In [21]:
precios_semana_20200419.head(5)

       precio          sucursal_id       producto_id
11125  829.00  2006-01-10 00:00:00  1012300006000003
11126   59.00  2026-01-10 00:00:00  1012300049000008
11127   59.00  1933-01-10 00:00:00  1012300073000005
11128    7.49  1948-01-10 00:00:00  1012300073000005
11129   59.00  1933-01-10 00:00:00  1012300075000003

I work on the "sucursal_id" column

In [57]:
precios_semana_20200419.sucursal_id = precios_semana_20200419.sucursal_id.str.replace('00:00:00', '') # I erase the timestamp

In [22]:
precios_semana_20200419.sucursal_id = precios_semana_20200419.sucursal_id.str.replace('\s*\b\d{4}-\d{2}-\d{2}[TRS]\d{2}:\d{2}:\d{2}Z\b', '')  # I replace the timestamp values

C:\Users\Auli\AppData\Local\Temp\ipykernel_14064\537415135.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  precios_semana_20200419.sucursal_id = precios_semana_20200419.sucursal_id.str.replace('\s*\b\d{4}-\d{2}-\d{2}[TRS]\d{2}:\d{2}:\d{2}Z\b', '')  # reemplazo los valores de tiempo en el campo por nada

In [23]:
precios_semana_20200419.head(5)

       precio sucursal_id       producto_id
11125  829.00         NaN  1012300006000003
11126   59.00         NaN  1012300049000008
11127   59.00         NaN  1012300073000005
11128    7.49         NaN  1012300073000005
11129   59.00         NaN  1012300075000003

In [24]:
precios_semana_20200419[precios_semana_20200419.sucursal_id.notna()] # there are "sucursal_id" missing values

        precio sucursal_id       producto_id
11132    89.90    10-1-112  1012300377000008
11133    59.90    10-1-139  1012300377000008
11134    64.90    10-1-159  1012300377000008
11135    39.90    10-1-179  1012300377000008
11141    69.90    10-1-139  1012300397000002
...        ...         ...               ...
457720  500.00     9-2-583   920000000995771
457721  404.00     9-2-953   920000000995771
457722  349.99     9-2-107   920000000999137
457723  145.00     9-2-583   920000000999755
457724  305.00     9-2-953   920000000999755

[8539 rows x 3 columns]

In [25]:
precios_semana_sin_sucursalid = precios_semana_20200419[precios_semana_20200419.sucursal_id.isna()].index # I create the index of "sucursal_id" missing values

In [26]:
precios_semana_20200419.drop(precios_semana_sin_sucursalid, inplace=True) # I use the index to drop some entries

In [27]:
precios_semana_20200419.head(5) # Everything seems in order

       precio sucursal_id       producto_id
11132    89.9    10-1-112  1012300377000008
11133    59.9    10-1-139  1012300377000008
11134    64.9    10-1-159  1012300377000008
11135    39.9    10-1-179  1012300377000008
11141    69.9    10-1-139  1012300397000002

## "precios_seamana_202004013" dataset

In [76]:
precios_semana_20200413.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472166 entries, 0 to 472165
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   precio       472153 non-null  float64
 1   producto_id  472151 non-null  object
 2   sucursal_id  472151 non-null  object
dtypes: float64(1), object(2)
memory usage: 10.8+ MB

In [77]:
precios_semana_20200413.head(5) # The "producto_id" and "sucursal_id" columns are inverted

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

In [4]:
precios_semana_20200413 = precios_semana_20200413[['precio', 'sucursal_id', 'producto_id']] # I change the columns order

In [5]:
precios_semana_20200413.head(5)

   precio sucursal_id    producto_id
0   29.90     2-1-014  0000000001663
1   29.90     2-1-032  0000000002288
2   39.90     2-1-096  0000000002288
3  499.99     9-1-686  0000000205870
4  519.99     9-2-248  0000000205870

I work on the "producto_id" column

In [6]:
precios_semana_20200413.producto_id.isna().sum() # There are missing values

15

In [7]:
precios_semana_sin_productoid = precios_semana_20200413[precios_semana_20200413.producto_id.isna()].index 
# I create the index of entries with "producto_id" missing values

In [8]:
precios_semana_20200413.drop(precios_semana_sin_productoid, inplace=True) # I use the index to drop some entries

In [9]:
precios_semana_20200413.producto_id = precios_semana_20200413.producto_id.str.replace('-', '') 
# I erase the middle dash

In [10]:
precios_semana_20200413.producto_id = precios_semana_20200413.producto_id.astype(np.int64) 
# I convert the "producto_id" to integer

In [11]:
precios_semana_20200413.head(5)

   precio sucursal_id  producto_id
0   29.90     2-1-014         1663
1   29.90     2-1-032         2288
2   39.90     2-1-096         2288
3  499.99     9-1-686       205870
4  519.99     9-2-248       205870

I work on the "sucursal_id" column

In [89]:
precios_semana_20200413.sucursal_id.isna().sum() # There are no missing values

0

In [28]:
print(precios_semana_20200413.count())
print(precios_semana_20200419.count())

precio         472151
sucursal_id    472151
producto_id    472151
dtype: int64
precio         8435
sucursal_id    8539
producto_id    8539
dtype: int64

In [32]:
precios = pd.concat([precios_semana_20200413, precios_semana_20200419])

In [34]:
precios.drop_duplicates()

        precio sucursal_id      producto_id
0        29.90     2-1-014             1663
1        29.90     2-1-032             2288
2        39.90     2-1-096             2288
3       499.99     9-1-686           205870
4       519.99     9-2-248           205870
...        ...         ...              ...
457709   89.00     9-2-583  920000000992794
457710  129.00     9-2-953  920000000992794
457712  145.00     9-2-953  920000000992855
457715  509.00     9-2-107  920000000995696
457722  349.99     9-2-107  920000000999137

[477160 rows x 3 columns]

In [31]:
pd.concat([precios_semana_20200413, precios_semana_20200419], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([ 11132,  11133,  11134,  11135,  11141,  11145,  11146,  11149,
             11150,  11151,
            ...
            457715, 457716, 457717, 457718, 457719, 457720, 457721, 457722,
            457723, 457724],
           dtype='int64', length=8539)

## I'm going to concat all weekly sales dataframes and work on them

In [120]:
precio = pd.concat([precios_semana_20200413, precios_semana_20200419, precios_semana_20200426, precios_semana_20200503, precios_semana_20200518])

In [121]:
precio.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2222645 entries, 0 to 415292
Data columns (total 3 columns):
 #   Column       Dtype
---  ------       -----
 0   precio       object
 1   producto_id  object
 2   sucursal_id  object
dtypes: object(3)
memory usage: 67.8+ MB

In [92]:
precio.drop_duplicates(inplace=True)

In [72]:
precio.columns

Index(['precio', 'producto_id', 'sucursal_id'], dtype='object')

In [122]:
index = ['precio', 'sucursal_id', 'producto_id']

In [125]:
precio.columns.all != index

True

In [126]:
precio = precio[index]

In [127]:
precio

        precio sucursal_id    producto_id
0         29.9     2-1-014  0000000001663
1         29.9     2-1-032  0000000002288
2         39.9     2-1-096  0000000002288
3       499.99     9-1-686  0000000205870
4       519.99     9-2-248  0000000205870
...        ...         ...            ...
415288  149.99      25-1-1  9569753142128
415289   34.99      25-1-1  9795403001143
415290   312.5       5-1-4  9990385651922
415291   312.5       5-1-4  9990385651939
415292   198.9       5-1-4  9990385651946

[2222645 rows x 3 columns]

In [81]:
correcion_index(precio)

        precio sucursal_id    producto_id
0         29.9     2-1-014  0000000001663
1         29.9     2-1-032  0000000002288
2         39.9     2-1-096  0000000002288
3       499.99     9-1-686  0000000205870
4       519.99     9-2-248  0000000205870
...        ...         ...            ...
415284   328.0     2-1-009  9312631144451
415288  149.99      25-1-1  9569753142128
415290   312.5       5-1-4  9990385651922
415291   312.5       5-1-4  9990385651939
415292   198.9       5-1-4  9990385651946

[1906972 rows x 3 columns]

In [84]:
precio = correcion_index(precio)

In [128]:
precio

        precio sucursal_id    producto_id
0         29.9     2-1-014  0000000001663
1         29.9     2-1-032  0000000002288
2         39.9     2-1-096  0000000002288
3       499.99     9-1-686  0000000205870
4       519.99     9-2-248  0000000205870
...        ...         ...            ...
415288  149.99      25-1-1  9569753142128
415289   34.99      25-1-1  9795403001143
415290   312.5       5-1-4  9990385651922
415291   312.5       5-1-4  9990385651939
415292   198.9       5-1-4  9990385651946

[2222645 rows x 3 columns]

In [80]:
def correcion_index(df):
    index = ['precio', 'sucursal_id', 'producto_id']
    if df.columns.all != index:
        df = df[index]
    return df

In [88]:
precios_semana_20200426 = correcion_index(precios_semana_20200426)

In [89]:
precios_semana_20200426

         precio sucursal_id   producto_id
0         399.0     2-1-092  2.288000e+03
1         299.0     2-1-206  2.288000e+03
2         399.0     2-2-241  2.288000e+03
3       49999.0     9-1-430  2.058700e+05
4       53999.0       9-2-4  2.058700e+05
...         ...         ...           ...
478904  13999.0      25-1-1  9.569753e+12
478905   3499.0      25-1-1  9.795403e+12
478906   3125.0       5-1-3  9.990386e+12
478907   3125.0       5-1-3  9.990386e+12
478908   1989.0       5-1-3  9.990386e+12

[478909 rows x 3 columns]

In [151]:
precio.sucursal_id.isna().sum() # I check for missing values

0

In [131]:
precio_sin_sucursalid = precio[precio.sucursal_id.isna()].index # I create an index of "sucursal_id" missing values

In [132]:
precio.drop(precio_sin_sucursalid, inplace=True) 
# I use the index to drop some entries

In [146]:
precio.producto_id.isna().sum() # I check for missing values

0

In [134]:
precio_sin_productoid = precio[precio.producto_id.isna()].index # I create an index of "producto_id" missing values

In [135]:
precio.drop(precio_sin_productoid, inplace=True)
# I use the index to drop some entries

In [139]:
precio.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2165641 entries, 0 to 415292
Data columns (total 3 columns):
 #   Column       Dtype
---  ------       -----
 0   precio       object
 1   sucursal_id  object
 2   producto_id  object
dtypes: object(3)
memory usage: 66.1+ MB

In [142]:
precio.sucursal_id = precio.sucursal_id.str.replace('-', '')

In [144]:
precio.head(5)

   precio sucursal_id    producto_id
0    29.9       21014  0000000001663
1    29.9       21032  0000000002288
2    39.9       21096  0000000002288
3  499.99       91686  0000000205870
4  519.99       92248  0000000205870

In [150]:
precio.sucursal_id = precio.sucursal_id.astype(int)

In [148]:
precio_sin_sucursalid = precio[precio.sucursal_id.isna()].index # I create an index for "sucursal_id" missing values

In [149]:
precio.drop(precio_sin_sucursalid, inplace=True)

## I export the dataframes as csv

In [149]:
precios_semana_20200518.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\precios_semana_20200518.csv')
precios_semana_20200503.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\precios_semana_20200503.csv')
precios_semana_20200426.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\precios_semana_20200426.csv')
precios_semana_20200419.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\precios_semana_20200419.csv')
precios_semana_20200413.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\precios_semana_20200413.csv')
Producto.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\producto.csv')
Sucursal.to_csv(r'C:\Users\Auli\Documents\Henry\Daft-04\Proyecto Individual 1\PI01_DATA_ENGINEERING\Datasets csv\sucursal.csv')